---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailed
source: html/1a5e2d9b-4a85-b268-1c60-169bf8a187cb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.GeomStepFailed Property

Can't rebuild geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId GeomStepFailed { get; }
```